<?php 
// 版本 2019 Powered by 陈橙子 QQ312383335
$db_host='127.0.0.1';
$db_username='root';//数据库帐号
$db_password='123456';//数据库密码
//===============游戏分区=================================
$qu  = $_POST['qu'];
if($_POST['qu']==1){
	$dbgame='xntg';//一区角色数据库
}elseif($_POST['qu']==2){
	$dbgame='xntg1';//二区角色数据库
}
elseif($_POST['qu']==3){
	$dbgame='xntg2';//三区角色数据库
}
elseif($_POST['qu']==4){
	$dbgame='xntg3';//四区角色数据库
}
elseif($_POST['qu']==5){
	$dbgame='xntg4';//五区角色数据库
}
//=========================================================
$admin='951918325'; 	//首次登陆账号
$adminpass='qq951918325qq';  //首次登陆密码	
$gmdb = "Qq312383335";	//后台数据库名称
//=========================================================
$goodsid  = 200000;  // 在线福利数量 
?>